## Overview of Sequences

Let us go through some of the important details related to sequences.

* For almost all the tables in relational databases we define primary key constraints.
* Primary key is nothing but unique constraint with not null and there can be only one primary key in any given table.
* Many times, we might not have appropriate column in the table which can be used as primary key. In those scenarios we will define a column which does not have any business relevant values. This is called as **surrogate key**.
* Relational Database technologies provide sequences to support these **surrogate primary keys**.
* In postgres we can define **surrogate primary key** for a given table as `SERIAL`. Internally it will create a sequence.
* We can also pre-create a sequence and use it to populate multiple tables.
* Even if we do not specify the column and value as part of the insert statement, a sequence generated number will be populated in that column.
* Typically, the sequence generated number will be incremented by 1. We can change it by specifying a constant value using `INCREMENT BY`.
* Here are some of the properties that can be set for a sequence. Most of them are self explanatory.
  * `START WITH`
  * `RESTART WITH`
  * `MINVALUE`
  * `MAXVALUE`
  * `CACHE`
* We can use functions such as `nextval` and `currval` to explicitly generate sequence numbers and also to get current sequence number in the current session.
* We might have to use `RESTART WITH` to reset the sequences after the underlying tables are populated with values in surrogate key.

In [ ]:
%load_ext sql

In [91]:
%env DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

env: DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

```{note}
Let us create a sequence which start with 101 with minimum value 101 and maximum value 1000.
```

In [92]:
%%sql

DROP SEQUENCE IF EXISTS test_seq

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [93]:
%%sql

CREATE SEQUENCE test_seq
START WITH 101
MINVALUE 101
MAXVALUE 1000
INCREMENT BY 100

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [94]:
%sql SELECT currval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
(psycopg2.errors.ObjectNotInPrerequisiteState) currval of sequence "test_seq" is not yet defined in this session

[SQL: SELECT currval('test_seq')]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [95]:
%sql SELECT nextval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(101,)]

In [96]:
%sql SELECT currval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(101,)]

In [97]:
%sql SELECT nextval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(201,)]

In [98]:
%sql SELECT currval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(201,)]

In [99]:
%sql SELECT nextval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(301,)]

In [100]:
%sql SELECT currval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(301,)]

In [101]:
%%sql

ALTER SEQUENCE test_seq
INCREMENT BY 1
RESTART WITH 101

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [102]:
%sql SELECT nextval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(101,)]

In [103]:
%sql SELECT currval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(101,)]

In [104]:
%sql SELECT nextval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(102,)]

In [105]:
%sql SELECT currval('test_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(102,)]

In [106]:
%sql DROP SEQUENCE test_seq

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

```{note}
`SERIAL` will make sure user_id is populated using sequence and `PRIMARY KEY` will enforce not null and unique constraints.
```

In [107]:
%sql DROP TABLE IF EXISTS users

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [108]:
%sql DROP SEQUENCE IF EXISTS users_user_id_seq

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [109]:
%%sql

CREATE TABLE users (
    user_id SERIAL PRIMARY KEY,
    user_first_name VARCHAR(30) NOT NULL,
    user_last_name VARCHAR(30) NOT NULL,
    user_email_id VARCHAR(50) NOT NULL,
    user_email_validated BOOLEAN,
    user_password VARCHAR(200),
    user_role VARCHAR(1),
    is_active BOOLEAN,
    created_dt DATE DEFAULT CURRENT_DATE
)

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [110]:
%%sql

SELECT * FROM information_schema.sequences

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[('itversity_retail_db', 'public', 'users_user_id_seq', 'integer', 32, 2, 0, '1', '1', '2147483647', '1', 'NO')]

In [111]:
%sql SELECT nextval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(1,)]

In [112]:
%sql SELECT currval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(1,)]

In [113]:
%%sql

INSERT INTO users (user_first_name, user_last_name, user_email_id)
VALUES ('Donald', 'Duck', 'donald@duck.com')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[]

In [114]:
%%sql

SELECT * FROM users

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(2, 'Donald', 'Duck', 'donald@duck.com', None, None, None, None, datetime.date(2020, 11, 23))]

In [115]:
%%sql

INSERT INTO users (user_first_name, user_last_name, user_email_id, user_role, is_active)
VALUES ('Mickey', 'Mouse', 'mickey@mouse.com', 'U', true)

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[]

In [116]:
%%sql

SELECT * FROM users

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
2 rows affected.

[(2, 'Donald', 'Duck', 'donald@duck.com', None, None, None, None, datetime.date(2020, 11, 23)),
 (3, 'Mickey', 'Mouse', 'mickey@mouse.com', None, None, 'U', True, datetime.date(2020, 11, 23))]

In [117]:
%%sql

INSERT INTO users 
    (user_first_name, user_last_name, user_email_id, user_password, user_role, is_active) 
VALUES 
    ('Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', true),
    ('Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', true),
    ('Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', true)

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
3 rows affected.

[]

In [118]:
%sql SELECT currval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(6,)]

In [119]:
%sql SELECT * FROM users

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
5 rows affected.

[(2, 'Donald', 'Duck', 'donald@duck.com', None, None, None, None, datetime.date(2020, 11, 23)),
 (3, 'Mickey', 'Mouse', 'mickey@mouse.com', None, None, 'U', True, datetime.date(2020, 11, 23)),
 (4, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', None, 'h9LAz7p7ub', 'U', True, datetime.date(2020, 11, 23)),
 (5, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', None, 'oEofndp', 'U', True, datetime.date(2020, 11, 23)),
 (6, 'Addie', 'Mesias', 'amesias2@twitpic.com', None, 'ih7Y69u56', 'U', True, datetime.date(2020, 11, 23))]

```{warning}
It is not a good idea to populate surrogate key fields by passing the values. Either we should specify sequence generated number or let database take care of populating the field.
```

In [120]:
%%sql

INSERT INTO users (user_id, user_first_name, user_last_name, user_email_id)
VALUES (7, 'Scott', 'Tiger', 'scott@tiger.com')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[]

In [121]:
%sql SELECT currval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(6,)]

```{note}
When data is loaded with surrogate key values into the table from external sources, it is recommended to create sequence with maximum + 1 value using`START WITH`
```

In [122]:
%sql DROP TABLE IF EXISTS users

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [123]:
%sql DROP SEQUENCE IF EXISTS users_user_id_seq

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

```{note}
`SERIAL` will make sure user_id is populated using sequence and `PRIMARY KEY` will enforce not null and unique constraints.
```

In [124]:
%%sql

CREATE TABLE users (
    user_id SERIAL PRIMARY KEY,
    user_first_name VARCHAR(30) NOT NULL,
    user_last_name VARCHAR(30) NOT NULL,
    user_email_id VARCHAR(50) NOT NULL,
    user_email_validated BOOLEAN,
    user_password VARCHAR(200),
    user_role VARCHAR(1),
    is_active BOOLEAN,
    created_dt DATE DEFAULT CURRENT_DATE
)

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [125]:
%%sql

INSERT INTO users (user_id, user_first_name, user_last_name, user_email_id)
VALUES (1, 'Donald', 'Duck', 'donald@duck.com')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[]

In [126]:
%%sql

INSERT INTO users (user_id, user_first_name, user_last_name, user_email_id, user_role, is_active)
VALUES (2, 'Mickey', 'Mouse', 'mickey@mouse.com', 'U', true)

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[]

In [127]:
%%sql

INSERT INTO users 
    (user_id, user_first_name, user_last_name, user_email_id, user_password, user_role, is_active) 
VALUES 
    (3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', true),
    (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', true),
    (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', true)

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
3 rows affected.

[]

In [128]:
%sql SELECT * FROM users

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
5 rows affected.

[(1, 'Donald', 'Duck', 'donald@duck.com', None, None, None, None, datetime.date(2020, 11, 23)),
 (2, 'Mickey', 'Mouse', 'mickey@mouse.com', None, None, 'U', True, datetime.date(2020, 11, 23)),
 (3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', None, 'h9LAz7p7ub', 'U', True, datetime.date(2020, 11, 23)),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', None, 'oEofndp', 'U', True, datetime.date(2020, 11, 23)),
 (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', None, 'ih7Y69u56', 'U', True, datetime.date(2020, 11, 23))]

In [129]:
%sql SELECT nextval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(1,)]

In [130]:
%sql SELECT currval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(1,)]

In [131]:
%sql ALTER SEQUENCE users_user_id_seq RESTART WITH 5

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [132]:
%sql SELECT currval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(1,)]

In [133]:
%sql SELECT nextval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(5,)]

In [134]:
%sql SELECT currval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(5,)]

In [135]:
%%sql

INSERT INTO users (user_first_name, user_last_name, user_email_id)
VALUES ('Scott', 'Tiger', 'scott@tiger.com')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[]

In [136]:
%sql SELECT currval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(6,)]

In [137]:
%sql SELECT * FROM users

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
6 rows affected.

[(1, 'Donald', 'Duck', 'donald@duck.com', None, None, None, None, datetime.date(2020, 11, 23)),
 (2, 'Mickey', 'Mouse', 'mickey@mouse.com', None, None, 'U', True, datetime.date(2020, 11, 23)),
 (3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', None, 'h9LAz7p7ub', 'U', True, datetime.date(2020, 11, 23)),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', None, 'oEofndp', 'U', True, datetime.date(2020, 11, 23)),
 (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', None, 'ih7Y69u56', 'U', True, datetime.date(2020, 11, 23)),
 (6, 'Scott', 'Tiger', 'scott@tiger.com', None, None, None, None, datetime.date(2020, 11, 23))]

In [138]:
%sql DROP SEQUENCE users_user_id_seq CASCADE

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [139]:
%sql SELECT * FROM users

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
6 rows affected.

[(1, 'Donald', 'Duck', 'donald@duck.com', None, None, None, None, datetime.date(2020, 11, 23)),
 (2, 'Mickey', 'Mouse', 'mickey@mouse.com', None, None, 'U', True, datetime.date(2020, 11, 23)),
 (3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', None, 'h9LAz7p7ub', 'U', True, datetime.date(2020, 11, 23)),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', None, 'oEofndp', 'U', True, datetime.date(2020, 11, 23)),
 (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', None, 'ih7Y69u56', 'U', True, datetime.date(2020, 11, 23)),
 (6, 'Scott', 'Tiger', 'scott@tiger.com', None, None, None, None, datetime.date(2020, 11, 23))]

In [140]:
%%sql

CREATE SEQUENCE users_user_id_seq 
    START WITH 7
    MINVALUE 1

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [141]:
%%sql

ALTER SEQUENCE users_user_id_seq
    OWNED BY users.user_id

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [142]:
%%sql 

ALTER TABLE users 
    ALTER COLUMN user_id 
    SET DEFAULT nextval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
Done.

[]

In [143]:
%%sql

INSERT INTO users (user_first_name, user_last_name, user_email_id)
VALUES ('Matt', 'Clarke', 'matt@clarke.com')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[]

In [144]:
%sql SELECT * FROM users

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
7 rows affected.

[(1, 'Donald', 'Duck', 'donald@duck.com', None, None, None, None, datetime.date(2020, 11, 23)),
 (2, 'Mickey', 'Mouse', 'mickey@mouse.com', None, None, 'U', True, datetime.date(2020, 11, 23)),
 (3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', None, 'h9LAz7p7ub', 'U', True, datetime.date(2020, 11, 23)),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', None, 'oEofndp', 'U', True, datetime.date(2020, 11, 23)),
 (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', None, 'ih7Y69u56', 'U', True, datetime.date(2020, 11, 23)),
 (6, 'Scott', 'Tiger', 'scott@tiger.com', None, None, None, None, datetime.date(2020, 11, 23)),
 (7, 'Matt', 'Clarke', 'matt@clarke.com', None, None, None, None, datetime.date(2020, 11, 23))]

In [145]:
%sql SELECT currval('users_user_id_seq')

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(7,)]